# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-eid'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'grep'
brew 'httpie'
brew 'rbenv'
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure

# Development
brew 'php'

# Apps
cask 'bitwarden'
cask 'discord'
cask 'docker'
cask 'google-chrome'
cask 'insomnia'
cask 'iterm2'
cask 'java'
cask 'jetbrains-toolbox'
cask 'slack'
cask 'spectacle'
cask 'spotify'
cask 'tableplus'
cask 'there'
cask 'the-unarchiver'
cask 'whatsapp'
cask 'visual-studio-code'

# Fonts
cask 'font-hack-nerd-font'
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# ZSH
cask 'zsh-autosuggestions'
