# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-eid'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'git-flow'
brew 'gnupg2'
brew 'grep'
brew 'httpie'
brew 'hub'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'rbenv'
brew 'svn'
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
brew 'zlib' # Needed for Memcached

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Development
brew 'php'
brew 'php@7.4'
brew 'php@7.3'
brew 'php@7.2'
brew 'composer'
brew 'imagemagick'
brew 'libmemcached'
brew 'memcached'
brew 'mysql'
brew 'nginx'
brew 'node'
brew 'redis'
brew 'yarn'

# Apps
cask 'alfred3'
cask 'bitwarden'
cask 'dash'
cask 'dbngin'
cask 'discord'
cask 'docker'
cask 'google-chrome'
cask 'gpg-suite'
cask 'hiddenbar'
cask 'imageoptim'
cask 'insomnia'
cask 'iterm2'
cask 'java'
cask 'jetbrains-toolbox'
cask 'megasync'
cask 'phpstorm'
cask 'slack'
cask 'spectacle'
cask 'spotify'
cask 'sublime-text'
cask 'tableplus'
cask 'there'
cask 'the-unarchiver'
cask 'tinkerwell'
cask 'typora'
cask 'whatsapp'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-hack-nerd-font'
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# ZSH
cask 'zsh-autosuggestions'

# Mac App Store
mas "Spark", id: 1176895641
mas "TweetDeck", id: 485812721
mas "Monosnap", id: 540348655
